In [2]:
#Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.
import pandas as pd

In [3]:
pip install pandas

Requirement already satisfied: pandas in /opt/conda/lib/python3.10/site-packages (1.5.2)
Requirement already satisfied: python-dateutil>=2.8.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2022.6)
Requirement already satisfied: numpy>=1.21.0 in /opt/conda/lib/python3.10/site-packages (from pandas) (1.23.5)
Requirement already satisfied: six>=1.5 in /opt/conda/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [4]:
list = [4,8,15,16,23,42]
s = pd.Series(list)

In [5]:
s

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [6]:
list1 = [3,5,6,2,5,6]
s1= pd.Series(list1)

In [7]:
s1

0    3
1    5
2    6
3    2
4    5
5    6
dtype: int64

In [8]:
# Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
# variable print it.

In [9]:
#1. Addition
s+s1

0     7
1    13
2    21
3    18
4    28
5    48
dtype: int64

In [10]:
var1 = pd.Series([1,2,3,4], index = 'usa  bali uk  rome'.split()) # question to ask why we use split.

In [11]:
var1

usa     1
bali    2
uk      3
rome    4
dtype: int64

In [12]:
#multiplication
s*s1

0     12
1     40
2     90
3     32
4    115
5    252
dtype: int64

In [13]:
#Using iloc we can extract data in between two indexes
var1.iloc[0:2]

usa     1
bali    2
dtype: int64

In [14]:
s.dtypes

dtype('int64')

In [15]:
# finding mean value of s

In [16]:
s.mean()

18.0

In [17]:
s1.abs()

0    3
1    5
2    6
3    2
4    5
5    6
dtype: int64

In [18]:
s1.count()

6

In [19]:
s1.is_unique

False

In [20]:
#Q3. Create a Pandas DataFrame that contains the following data:
data = {
    "name" : ['Alice' , 'Bob', 'Claire'],
    "age" :[25,30,27],
    "gender" : ['female', 'male' ,'female']
}
df = pd.DataFrame(data)

In [21]:
df

     name  age  gender
0   Alice   25  female
1     Bob   30    male
2  Claire   27  female

In [22]:
#  Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

# DataFrame: It is two dimensional data structure in pandas which is in the tabular form which means it stores the data in the tabular form.
# Series: Pandas Series is a one-dimensional labeled array whose object size cannot be changed.

In [23]:
#example
df # it represents the data frame which consist of rows and columns

     name  age  gender
0   Alice   25  female
1     Bob   30    male
2  Claire   27  female

In [24]:
s1# this is an example of series

0    3
1    5
2    6
3    2
4    5
5    6
dtype: int64

In [25]:
# Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
# you give an example of when you might use one of these functions?

In [26]:
# some common function are 
#1.head() it gives the first five or you can also extract only the data of the first column using head(1)
df.head(2)

    name  age  gender
0  Alice   25  female
1    Bob   30    male

In [29]:
s.index.size #index.size is used  to find the number of elements in the underlying data of the given Index object.

6

In [31]:
s1.sample(3) # sample is used to give any three random value in it.

2    6
1    5
5    6
dtype: int64

In [32]:
# Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

# All the data structures of the pandas are mutable.Expect series, series is also mutable but size immutable.

In [33]:
# Q7. Create a DataFrame using multiple Series. Explain with an example.

In [34]:
course = pd.Series(["spark" , "pyspark" , "Hadoop"])

In [35]:
course

0      spark
1    pyspark
2     Hadoop
dtype: object

In [36]:
Fees = pd.Series([20000 , 25000 , 30000])

In [37]:
Fees

0    20000
1    25000
2    30000
dtype: int64

In [38]:
Discount = pd.Series([1000 , 2000 , 3000])

In [39]:
Discount

0    1000
1    2000
2    3000
dtype: int64

In [42]:
#so these three are the series course Fee and discount now we are going to make it data Frame.
df1 = pd.concat([course,Fees,Discount],axis=1) #axis = 1 refers to vertical axis or columns.

In [43]:
df1

         0      1     2
0    spark  20000  1000
1  pyspark  25000  2000
2   Hadoop  30000  3000